# Executing a multi-line coffeescript script

```coffee
fn = (message) ->
    console.log(message)

fn("hi")
console.log x for x in [2,4,5]
```

```results
: hi
: 2
: 4
: 5
```

# Executing a multi-line python script
#+BEGIN_SRC python
def twice(i):
    return i*2

print "\n".join([str(twice(x)) for x in range(1,5)])
#+END_SRC

#+RESULTS:
: 2
: 4
: 6
: 8

# Output of shell scripts
I've intentionally excluded a result section here -- running will return the info in a
notification.

```shell
curl -Is "https://github.com" | head -n 5
```
